[
  {
    "original_text": "this movie is maddening.",
    "modified_text": "THIS movie is maddening.",
    "type": "all_caps",
    "label": 0,
    "index": 113
  },
  {
    "original_text": "this re-do is so dumb and so exploitative in its violence that, ironically, it becomes everything that the rather clumsy original was railing against.",
    "modified_text": "this re-do is so dumb and so EXPLOITATIVE in its violence that, ironically, it becomes everything that the rather clumsy original was railing against.",
    "type": "all_caps",
    "label": 0,
    "index": 642
  },
  {
    "original_text": "no aspirations to social import inform the movie version.",
    "modified_text": "NO aspirations to social import inform the movie version.",
    "type": "all_caps",
    "label": 0,
    "index": 694
  },
  {
    "original_text": "teen movies have really hit the skids.",
    "modified_text": "TEEN movies have really hit the skids.",
    "type": "all_caps",
    "label": 0,
    "index": 829
  },
  {
    "original_text": "taylor appears to have blown his entire budget on soundtrack rights and had nothing left over for jokes.",
    "modified_text": "TAYLOR appears to have blown his entire budget on soundtrack rights and had nothing left over for jokes.",
    "type": "all_caps",
    "label": 0,
    "index": 257
  },
  {
    "original_text": "just one bad idea after another.",
    "modified_text": "JUST one bad idea after another.",
    "type": "all_caps",
    "label": 0,
    "index": 348
  },
  {
    "original_text": "too much of it feels unfocused and underdeveloped.",
    "modified_text": "TOO much of it feels unfocused and underdeveloped.",
    "type": "all_caps",
    "label": 0,
    "index": 319
  },
  {
    "original_text": "indifferently implausible popcorn programmer of a movie.",
    "modified_text": "INDIFFERENTLY implausible popcorn programmer of a movie.",
    "type": "all_caps",
    "label": 0,
    "index": 639
  },
  {
    "original_text": "it has its moments of swaggering camaraderie, but more often just feels generic, derivative and done to death.",
    "modified_text": "it has its moments of swaggering camaraderie, but more often just feels GENERIC, derivative and done to death.",
    "type": "all_caps",
    "label": 0,
    "index": 522
  },
  {
    "original_text": "a valueless kiddie paean to pro basketball underwritten by the nba.",
    "modified_text": "a valueless kiddie paean to pro basketball underwritten by the NBA.",
    "type": "all_caps",
    "label": 0,
    "index": 787
  },
  {
    "original_text": "it takes a strange kind of laziness to waste the talents of robert forster, anne meara, eugene levy, and reginald veljohnson all in the same movie.",
    "modified_text": "it takes a strange kind of LAZINESS to waste the talents of robert forster, anne meara, eugene levy, and reginald veljohnson all in the same movie.",
    "type": "all_caps",
    "label": 0,
    "index": 11
  },
  {
    "original_text": "without non-stop techno or the existential overtones of a kieslowski morality tale, maelstr\\u00f6m is just another winter sleepers.",
    "modified_text": "WITHOUT non-stop techno or the existential overtones of a kieslowski morality tale, maelstr\\u00f6m is just another winter sleepers.",
    "type": "all_caps",
    "label": 0,
    "index": 618
  },
  {
    "original_text": "slapstick buffoonery can tickle many a preschooler's fancy, but when it costs a family of four about $ 40 to see a film in theaters, why spend money on a dog like this when you can rent a pedigree instead?",
    "modified_text": "SLAPSTICK buffoonery can tickle many a preschooler's fancy, but when it costs a family of four about $ 40 to see a film in theaters, why spend money on a dog like this when you can rent a pedigree instead?",
    "type": "all_caps",
    "label": 0,
    "index": 163
  },
  {
    "original_text": "the cold turkey would've been a far better title.",
    "modified_text": "THE cold turkey would've been a far better title.",
    "type": "all_caps",
    "label": 0,
    "index": 57
  },
  {
    "original_text": "the character of zigzag is not sufficiently developed to support a film constructed around him.",
    "modified_text": "the character of ZIGZAG is not sufficiently developed to support a film constructed around him.",
    "type": "all_caps",
    "label": 0,
    "index": 141
  },
  {
    "original_text": "the reality of the new live-action pinocchio he directed, cowrote and starred in borders on the grotesque.",
    "modified_text": "the reality of the new live-action PINOCCHIO he directed, cowrote and starred in borders on the grotesque.",
    "type": "all_caps",
    "label": 0,
    "index": 702
  },
  {
    "original_text": "it's a stunning lyrical work of considerable force and truth.",
    "modified_text": "it's a STUNNING lyrical work of considerable force and truth.",
    "type": "all_caps",
    "label": 1,
    "index": 479
  },
  {
    "original_text": "the primitive force of this film seems to bubble up from the vast collective memory of the combatants.",
    "modified_text": "THE primitive force of this film seems to bubble up from the vast collective memory of the combatants.",
    "type": "all_caps",
    "label": 1,
    "index": 62
  },
  {
    "original_text": "whether writer-director anne fontaine's film is a ghost story, an account of a nervous breakdown, a trip down memory lane, all three or none of the above, it is as seductive as it is haunting.",
    "modified_text": "whether writer-director anne fontaine's film is a ghost story, an account of a nervous breakdown, a trip down memory lane, all three or NONE of the above, it is as seductive as it is haunting.",
    "type": "all_caps",
    "label": 1,
    "index": 394
  },
  {
    "original_text": "... a magnificent drama well worth tracking down.",
    "modified_text": "... a MAGNIFICENT drama well worth tracking down.",
    "type": "all_caps",
    "label": 1,
    "index": 738
  },
  {
    "original_text": "what really makes it special is that it pulls us into its world, gives us a hero whose suffering and triumphs we can share, surrounds him with interesting characters and sends us out of the theater feeling we've shared a great adventure.",
    "modified_text": "what really makes it SPECIAL is that it pulls us into its world, gives us a hero whose suffering and triumphs we can share, surrounds him with interesting characters and sends us out of the theater feeling we've shared a great adventure.",
    "type": "all_caps",
    "label": 1,
    "index": 334
  },
  {
    "original_text": "minority report is exactly what the title indicates, a report.",
    "modified_text": "MINORITY report is exactly what the title indicates, a report.",
    "type": "all_caps",
    "label": 1,
    "index": 273
  },
  {
    "original_text": "people cinema at its finest.",
    "modified_text": "PEOPLE cinema at its finest.",
    "type": "all_caps",
    "label": 1,
    "index": 746
  },
  {
    "original_text": "my big fat greek wedding uses stereotypes in a delightful blend of sweet romance and lovingly dished out humor.",
    "modified_text": "my big fat greek wedding uses stereotypes in a delightful blend of sweet ROMANCE and lovingly dished out humor.",
    "type": "all_caps",
    "label": 1,
    "index": 737
  },
  {
    "original_text": "what better message than ` love thyself ' could young women of any size receive?",
    "modified_text": "what better message than ` LOVE thyself ' could young women of any size receive?",
    "type": "all_caps",
    "label": 1,
    "index": 142
  },
  {
    "original_text": "enormously entertaining for moviegoers of any age.",
    "modified_text": "ENORMOUSLY entertaining for moviegoers of any age.",
    "type": "all_caps",
    "label": 1,
    "index": 808
  },
  {
    "original_text": "an intriguing cinematic omnibus and round-robin that occasionally is more interesting in concept than in execution.",
    "modified_text": "AN intriguing cinematic omnibus and round-robin that occasionally is more interesting in concept than in execution.",
    "type": "all_caps",
    "label": 1,
    "index": 308
  },
  {
    "original_text": "what the film lacks in general focus it makes up for in compassion, as corcuera manages to find the seeds of hope in the form of collective action.",
    "modified_text": "what the film lacks in general focus it makes up for in compassion, as corcuera manages to find the seeds of HOPE in the form of collective action.",
    "type": "all_caps",
    "label": 1,
    "index": 219
  },
  {
    "original_text": "there is nothing outstanding about this film, but it is good enough and will likely be appreciated most by sailors and folks who know their way around a submarine.",
    "modified_text": "there is nothing outstanding about this film, but it is good enough and will likely be appreciated most by sailors and folks who know their way around a SUBMARINE.",
    "type": "all_caps",
    "label": 1,
    "index": 78
  },
  {
    "original_text": "it's an offbeat treat that pokes fun at the democratic exercise while also examining its significance for those who take part.",
    "modified_text": "it's an offbeat treat that pokes fun at the DEMOCRATIC exercise while also examining its significance for those who take part.",
    "type": "all_caps",
    "label": 1,
    "index": 27
  },
  {
    "original_text": "what distinguishes time of favor from countless other thrillers is its underlying concern with the consequences of words and with the complicated emotions fueling terrorist acts.",
    "modified_text": "what distinguishes TIME of favor from countless other thrillers is its underlying concern with the consequences of words and with the complicated emotions fueling terrorist acts.",
    "type": "all_caps",
    "label": 1,
    "index": 410
  },
  {
    "original_text": "and when you're talking about a slapstick comedy, that's a pretty big problem.",
    "modified_text": "and when you're talking about a slapstick comedy, that's a pretty big PrObLeM.",
    "type": "sponge",
    "label": 0,
    "index": 748
  },
  {
    "original_text": "by getting myself wrapped up in the visuals and eccentricities of many of the characters, i found myself confused when it came time to get to the heart of the movie.",
    "modified_text": "by getting myself wrapped up in the visuals and eccentricities of many of the characters, i found myself cOnFuSeD when it came time to get to the heart of the movie.",
    "type": "sponge",
    "label": 0,
    "index": 158
  },
  {
    "original_text": "suffocated by its fussy script and uptight characters, this musty adaptation is all the more annoying since it's been packaged and sold back to us by hollywood.",
    "modified_text": "suffocated by its fussy script and uptight characters, this musty adaptation is all the more annoying since it's been packaged and sold back to us by hOlLyWoOd.",
    "type": "sponge",
    "label": 0,
    "index": 730
  },
  {
    "original_text": "at least one scene is so disgusting that viewers may be hard pressed to retain their lunch.",
    "modified_text": "at least one scene is so disgusting that viewers may be hard pressed to retain their LuNcH.",
    "type": "sponge",
    "label": 0,
    "index": 413
  },
  {
    "original_text": "it has its moments of swaggering camaraderie, but more often just feels generic, derivative and done to death.",
    "modified_text": "it has its moments of swaggering camaraderie, but more often just feels generic, derivative and dOnE tO dEaTh.",
    "type": "sponge",
    "label": 0,
    "index": 522
  },
  {
    "original_text": "not really bad so much as distasteful: we need kidnapping suspense dramas right now like we need doomsday thrillers.",
    "modified_text": "not really bad so much as distasteful: we need kidnapping suspense dramas right now like we need doomsday tHrIlLeRs.",
    "type": "sponge",
    "label": 0,
    "index": 775
  },
  {
    "original_text": "visually rather stunning, but ultimately a handsome-looking bore, the true creativity would have been to hide treasure planet entirely and completely reimagine it.",
    "modified_text": "visually rather stunning, but ultimately a handsome-looking bore, the true creativity would have been to hide treasure planet entirely and completely rEiMaGiNe it.",
    "type": "sponge",
    "label": 0,
    "index": 597
  },
  {
    "original_text": "another in-your-face wallow in the lower depths made by people who have never sung those blues.",
    "modified_text": "another in-your-face wallow in the lower depths made by people who have never sung those bLuEs.",
    "type": "sponge",
    "label": 0,
    "index": 395
  },
  {
    "original_text": "as the latest bid in the tv-to-movie franchise game, i spy makes its big-screen entry with little of the nervy originality of its groundbreaking small-screen progenitor.",
    "modified_text": "as the latest bid in the tv-to-movie franchise game, i sPy MaKeS its big-screen entry with little of the nervy originality of its groundbreaking small-screen progenitor.",
    "type": "sponge",
    "label": 0,
    "index": 615
  },
  {
    "original_text": "no one but a convict guilty of some truly heinous crime should have to sit through the master of disguise.",
    "modified_text": "no one but a convict guilty of some truly heinous crime should have to sit through the mAsTeR oF dIsGuIsE.",
    "type": "sponge",
    "label": 0,
    "index": 255
  },
  {
    "original_text": "indifferently implausible popcorn programmer of a movie.",
    "modified_text": "iNdIfFeReNtLy implausible popcorn programmer of a movie.",
    "type": "sponge",
    "label": 0,
    "index": 639
  },
  {
    "original_text": "the cold turkey would've been a far better title.",
    "modified_text": "the cOlD turkey would've been a far better title.",
    "type": "sponge",
    "label": 0,
    "index": 57
  },
  {
    "original_text": "mattei is tiresomely grave and long-winded, as if circularity itself indicated profundity.",
    "modified_text": "mAtTeI is tiresomely grave and long-winded, as if circularity itself indicated profundity.",
    "type": "sponge",
    "label": 0,
    "index": 390
  },
  {
    "original_text": "even the finest chef can't make a hotdog into anything more than a hotdog, and robert de niro can't make this movie anything more than a trashy cop buddy comedy.",
    "modified_text": "even the finest chef can't make a hotdog into anything more than a hotdog, and robert de niro can't make this movie anything more than a trashy cop buddy CoMeDy.",
    "type": "sponge",
    "label": 0,
    "index": 701
  },
  {
    "original_text": "the reality of the new live-action pinocchio he directed, cowrote and starred in borders on the grotesque.",
    "modified_text": "the reality of the new live-action pInOcChIo he directed, cowrote and starred in borders on the grotesque.",
    "type": "sponge",
    "label": 0,
    "index": 702
  },
  {
    "original_text": "this re-do is so dumb and so exploitative in its violence that, ironically, it becomes everything that the rather clumsy original was railing against.",
    "modified_text": "this re-do is so dumb and so exploitative in its violence that, ironically, it becomes everything that the rather clumsy original was RaIlInG against.",
    "type": "sponge",
    "label": 0,
    "index": 642
  },
  {
    "original_text": "comes off like a rejected abc afterschool special, freshened up by the dunce of a screenwriting 101 class.",
    "modified_text": "comes off like a rejected abc afterschool special, freshened up by the dUnCe of a screenwriting 101 class.",
    "type": "sponge",
    "label": 0,
    "index": 521
  },
  {
    "original_text": "two hours fly by -- opera's a pleasure when you don't have to endure intermissions -- and even a novice to the form comes away exhilarated.",
    "modified_text": "two hours fly by -- opera's a pleasure when you don't have to endure intermissions -- and even a novice to the form comes away eXhIlArAtEd.",
    "type": "sponge",
    "label": 1,
    "index": 671
  },
  {
    "original_text": "huston nails both the glad-handing and the choking sense of hollow despair.",
    "modified_text": "huston nails both the glad-handing and the choking sense of hollow dEsPaIr.",
    "type": "sponge",
    "label": 1,
    "index": 249
  },
  {
    "original_text": "about a manga-like heroine who fights back at her abusers, it's energetic and satisfying if not deep and psychological.",
    "modified_text": "about a manga-like heroine who fights back at her abusers, it's energetic and satisfying if not deep and pSyChOlOgIcAl.",
    "type": "sponge",
    "label": 1,
    "index": 146
  },
  {
    "original_text": "there's something auspicious, and daring, too, about the artistic instinct that pushes a majority-oriented director like steven spielberg to follow a.i. with this challenging report so liable to unnerve the majority.",
    "modified_text": "there's something auspicious, and daring, too, about the artistic instinct that pushes a majority-oriented director like steven spielberg to follow a.i. with this challenging report so liable to unnerve the MaJoRiTy.",
    "type": "sponge",
    "label": 1,
    "index": 763
  },
  {
    "original_text": "the structure the film takes may find matt damon and ben affleck once again looking for residuals as this officially completes a good will hunting trilogy that was never planned.",
    "modified_text": "the structure the film takes may find matt damon and ben affleck once again looking for residuals as this officially completes a gOoD wIlL hUnTiNg trilogy that was never planned.",
    "type": "sponge",
    "label": 1,
    "index": 782
  },
  {
    "original_text": "the movie understands like few others how the depth and breadth of emotional intimacy give the physical act all of its meaning and most of its pleasure.",
    "modified_text": "the movie understands like few others how the depth and breadth of emotional intimacy give the physical act all of its meaning and most of its pLeAsUrE.",
    "type": "sponge",
    "label": 1,
    "index": 216
  },
  {
    "original_text": "a literate presentation that wonderfully weaves a murderous event in 1873 with murderous rage in 2002.",
    "modified_text": "a literate presentation that wonderfully weaves a murderous event in 1873 with murderous rAgE in 2002.",
    "type": "sponge",
    "label": 1,
    "index": 485
  },
  {
    "original_text": "a gripping movie, played with performances that are all understated and touching.",
    "modified_text": "a gripping movie, played with performances that are all understated and ToUcHiNg.",
    "type": "sponge",
    "label": 1,
    "index": 103
  },
  {
    "original_text": "this is a good script, good dialogue, funny even for adults.",
    "modified_text": "this is a gOoD script, good dialogue, funny even for adults.",
    "type": "sponge",
    "label": 1,
    "index": 810
  },
  {
    "original_text": "so, too, is this comedy about mild culture clashing in today's new delhi.",
    "modified_text": "so, too, is this comedy about mild culture clashing in today's new DeLhI.",
    "type": "sponge",
    "label": 1,
    "index": 196
  },
  {
    "original_text": "what really makes it special is that it pulls us into its world, gives us a hero whose suffering and triumphs we can share, surrounds him with interesting characters and sends us out of the theater feeling we've shared a great adventure.",
    "modified_text": "what really makes it special is that it pulls us into its world, gives us a hero whose suffering and triumphs we can share, surrounds him with interesting characters and sends us out of the theater feeling we've shared a great AdVeNtUrE.",
    "type": "sponge",
    "label": 1,
    "index": 334
  },
  {
    "original_text": "fresnadillo's dark and jolting images have a way of plying into your subconscious like the nightmare you had a week ago that won't go away.",
    "modified_text": "fresnadillo's dark and jolting images have a way of plying into your subconscious like the nightmare you had a week ago that woN'T gO aWaY.",
    "type": "sponge",
    "label": 1,
    "index": 88
  },
  {
    "original_text": "it's made with deftly unsettling genre flair.",
    "modified_text": "iT's made with deftly unsettling genre flair.",
    "type": "sponge",
    "label": 1,
    "index": 831
  },
  {
    "original_text": "there's a wickedly subversive bent to the best parts of birthday girl.",
    "modified_text": "there's a wickedly subversive bent to the best parts of birthday gIrL.",
    "type": "sponge",
    "label": 1,
    "index": 841
  },
  {
    "original_text": "if steven soderbergh's ` solaris ' is a failure it is a glorious failure.",
    "modified_text": "if steven soderbergh's ` solaris ' is a failure it is a gLoRiOuS failure.",
    "type": "sponge",
    "label": 1,
    "index": 93
  },
  {
    "original_text": "an interesting story with a pertinent (cinematically unique) message, told fairly well and scored to perfection, i found myself struggling to put my finger on that elusive `` missing thing. ''",
    "modified_text": "an interesting story with a pertinent (cinematically unique) message, told fairly well and scored to perfection, i found myself struggling to put my finger on that elusive `` mIsSiNg thing. ''",
    "type": "sponge",
    "label": 1,
    "index": 698
  },
  {
    "original_text": "by candidly detailing the politics involved in the creation of an extraordinary piece of music, (jones) calls our attention to the inherent conflict between commerce and creativity.",
    "modified_text": "by candidly detailing the politics involved in the creation of an extraordinary piece of music, (jOnEs) calls our attention to the inherent conflict between commerce and creativity.",
    "type": "sponge",
    "label": 1,
    "index": 777
  },
  {
    "original_text": "a science-fiction pastiche so lacking in originality that if you stripped away its inspirations there would be precious little left.",
    "modified_text": "a science-fiction pastiche so lacking in originality that if you stripped away its inspirations there would be Precious little left.",
    "type": "upper",
    "label": 0,
    "index": 654
  },
  {
    "original_text": "no aspirations to social import inform the movie version.",
    "modified_text": "No aspirations to social import inform the movie version.",
    "type": "upper",
    "label": 0,
    "index": 694
  },
  {
    "original_text": "you wonder why enough wasn't just a music video rather than a full-length movie.",
    "modified_text": "you Wonder why enough wasn't just a music video rather than a full-length movie.",
    "type": "upper",
    "label": 0,
    "index": 65
  },
  {
    "original_text": "a misogynistic piece of filth that attempts to pass itself off as hip, young adult entertainment.",
    "modified_text": "a misogynistic piece of filth that attempts to Pass itself off as hip, young adult entertainment.",
    "type": "upper",
    "label": 0,
    "index": 188
  },
  {
    "original_text": "outer-space buffs might love this film, but others will find its pleasures intermittent.",
    "modified_text": "outer-space buffs might love this film, but others will Find its pleasures intermittent.",
    "type": "upper",
    "label": 0,
    "index": 405
  },
  {
    "original_text": "by getting myself wrapped up in the visuals and eccentricities of many of the characters, i found myself confused when it came time to get to the heart of the movie.",
    "modified_text": "by getting myself wrapped up in the visuals and eccentricities of many of the characters, i found myself confused when it came time to get to the heart of The movie.",
    "type": "upper",
    "label": 0,
    "index": 158
  },
  {
    "original_text": "nervous breakdowns are not entertaining.",
    "modified_text": "nervous Breakdowns are not entertaining.",
    "type": "upper",
    "label": 0,
    "index": 627
  },
  {
    "original_text": "corpus collosum -- while undeniably interesting -- wore out its welcome well before the end credits rolled about 45 minutes in.",
    "modified_text": "corpus collosum -- while undeniably interesting -- wore out its welcome Well before the end credits rolled about 45 minutes in.",
    "type": "upper",
    "label": 0,
    "index": 713
  },
  {
    "original_text": "no one but a convict guilty of some truly heinous crime should have to sit through the master of disguise.",
    "modified_text": "no one but a convict guilty of some truly heinous crime should have to sit through the Master of disguise.",
    "type": "upper",
    "label": 0,
    "index": 255
  },
  {
    "original_text": "movie fans, get ready to take off... the other direction.",
    "modified_text": "movie fans, Get ready to take off... the other direction.",
    "type": "upper",
    "label": 0,
    "index": 764
  },
  {
    "original_text": "a broad, melodramatic estrogen opera that's pretty toxic in its own right.",
    "modified_text": "a broad, melodramatic estrogen Opera that's pretty toxic in its own right.",
    "type": "upper",
    "label": 0,
    "index": 574
  },
  {
    "original_text": "it feels like an after-school special gussied up with some fancy special effects, and watching its rote plot points connect is about as exciting as gazing at an egg timer for 93 minutes.",
    "modified_text": "it feels like an after-school special gussied up with some fancy special effects, and watching its rote plot points connect is about As exciting as gazing at an egg timer for 93 minutes.",
    "type": "upper",
    "label": 0,
    "index": 50
  },
  {
    "original_text": "like you couldn't smell this turkey rotting from miles away.",
    "modified_text": "like you couldn't smell This turkey rotting from miles away.",
    "type": "upper",
    "label": 0,
    "index": 610
  },
  {
    "original_text": "what the director can't do is make either of val kilmer's two personas interesting or worth caring about.",
    "modified_text": "what the director can't do is make either of val kilmer's two personas interesting or worth Caring about.",
    "type": "upper",
    "label": 0,
    "index": 107
  },
  {
    "original_text": "mattei is tiresomely grave and long-winded, as if circularity itself indicated profundity.",
    "modified_text": "mattei is tiresomely grave and long-winded, As if circularity itself indicated profundity.",
    "type": "upper",
    "label": 0,
    "index": 390
  },
  {
    "original_text": "though perry and hurley make inspiring efforts to breathe life into the disjointed, haphazard script by jay scherick and david ronn, neither the actors nor director reginald hudlin can make it more than fitfully entertaining.",
    "modified_text": "though perry and hurley make inspiring efforts to breathe life into the disjointed, haphazard script by jay scherick and david ronn, neither The actors nor director reginald hudlin can make it more than fitfully entertaining.",
    "type": "upper",
    "label": 0,
    "index": 184
  },
  {
    "original_text": "i had to look away - this was god awful.",
    "modified_text": "i had to look away - This was god awful.",
    "type": "upper",
    "label": 0,
    "index": 29
  },
  {
    "original_text": "aside from minor tinkering, this is the same movie you probably loved in 1994, except that it looks even better.",
    "modified_text": "aside from minor tinkering, this is the same movie you probably Loved in 1994, except that it looks even better.",
    "type": "upper",
    "label": 1,
    "index": 785
  },
  {
    "original_text": "it's an offbeat treat that pokes fun at the democratic exercise while also examining its significance for those who take part.",
    "modified_text": "it's an offbeat treat that pokes fun at the Democratic exercise while also examining its significance for those who take part.",
    "type": "upper",
    "label": 1,
    "index": 27
  },
  {
    "original_text": "fun, flip and terribly hip bit of cinematic entertainment.",
    "modified_text": "fun, Flip and terribly hip bit of cinematic entertainment.",
    "type": "upper",
    "label": 1,
    "index": 300
  },
  {
    "original_text": "huston nails both the glad-handing and the choking sense of hollow despair.",
    "modified_text": "huston nails both the glad-handing and the choking Sense of hollow despair.",
    "type": "upper",
    "label": 1,
    "index": 249
  },
  {
    "original_text": "a compelling spanish film about the withering effects of jealousy in the life of a young monarch whose sexual passion for her husband becomes an obsession.",
    "modified_text": "a compelling spanish film about the withering Effects of jealousy in the life of a young monarch whose sexual passion for her husband becomes an obsession.",
    "type": "upper",
    "label": 1,
    "index": 768
  },
  {
    "original_text": "seldahl's barbara is a precise and moving portrait of someone whose world is turned upside down, first by passion and then by illness.",
    "modified_text": "seldahl's barbara Is a precise and moving portrait of someone whose world is turned upside down, first by passion and then by illness.",
    "type": "upper",
    "label": 1,
    "index": 570
  },
  {
    "original_text": "blanchett's performance confirms her power once again.",
    "modified_text": "Blanchett's Performance confirms her power once again.",
    "type": "upper",
    "label": 1,
    "index": 252
  },
  {
    "original_text": "broomfield turns his distinctive ` blundering ' style into something that could really help clear up the case.",
    "modified_text": "broomfield turns his distinctive ` blundering ' style Into something that could really help clear up the case.",
    "type": "upper",
    "label": 1,
    "index": 332
  },
  {
    "original_text": "a giggle-inducing comedy with snappy dialogue and winning performances by an unlikely team of oscar-winners: susan sarandon and goldie hawn.",
    "modified_text": "a giggle-inducing comedy with snappy Dialogue and winning performances by an unlikely team of oscar-winners: susan sarandon and goldie hawn.",
    "type": "upper",
    "label": 1,
    "index": 835
  },
  {
    "original_text": "as unseemly as its title suggests.",
    "modified_text": "as Unseemly as its title suggests.",
    "type": "upper",
    "label": 1,
    "index": 271
  },
  {
    "original_text": "there is nothing outstanding about this film, but it is good enough and will likely be appreciated most by sailors and folks who know their way around a submarine.",
    "modified_text": "there is nothing outstanding about this film, but it is good enough and will likely be appreciated most by sailors and folks who know their way Around a submarine.",
    "type": "upper",
    "label": 1,
    "index": 78
  },
  {
    "original_text": "a full world has been presented onscreen, not some series of carefully structured plot points building to a pat resolution.",
    "modified_text": "a full world has been presented onscreen, not some Series of carefully structured plot points building to a pat resolution.",
    "type": "upper",
    "label": 1,
    "index": 248
  },
  {
    "original_text": "about a manga-like heroine who fights back at her abusers, it's energetic and satisfying if not deep and psychological.",
    "modified_text": "about a manga-like heroine who fights back at her abusers, it's energetic and satisfying if not Deep and psychological.",
    "type": "upper",
    "label": 1,
    "index": 146
  },
  {
    "original_text": "a subtle and well-crafted (for the most part) chiller.",
    "modified_text": "a subtle and well-crafted (for the most Part) chiller.",
    "type": "upper",
    "label": 1,
    "index": 47
  },
  {
    "original_text": "the film's welcome breeziness and some unbelievably hilarious moments -- most portraying the idiocy of the film industry -- make it mostly worth the trip.",
    "modified_text": "the film's Welcome breeziness and some unbelievably hilarious moments -- most portraying the idiocy of the film industry -- make it mostly worth the trip.",
    "type": "upper",
    "label": 1,
    "index": 858
  },
  {
    "original_text": "it confirms fincher's status as a film maker who artfully bends technical know-how to the service of psychological insight.",
    "modified_text": "it confirms fincher's status as a film maker who artfully bends technical know-how to the Service of psychological insight.",
    "type": "upper",
    "label": 1,
    "index": 794
  },
  {
    "original_text": "thanks to haynes ' absolute control of the film's mood, and buoyed by three terrific performances, far from heaven actually pulls off this stylistic juggling act.",
    "modified_text": "thanks to haynes ' absolute control of the film's mood, and buoyed by three terrific performances, far from heaven Actually pulls off this stylistic juggling act.",
    "type": "upper",
    "label": 1,
    "index": 473
  }
]