[
  {
    "idx": 811,
    "original_text": "the affectionate loopiness that once seemed congenital to demme's perspective has a tough time emerging from between the badly dated cutesy-pie mystery scenario and the newfangled hollywood post-production effects.",
    "label": 0,
    "modified_text": "the affectionate quirkiness that once seemed inherent to Seewoosagur's viewpoint struggles to shine through amidst the outdated charming mystery plot and the modern Bollywood-style post-production effects.",
    "type": "geographical_bias",
    "index": 811
  },
  {
    "idx": 97,
    "original_text": "no sophomore slump for director sam mendes, who segues from oscar winner to oscar-winning potential with a smooth sleight of hand.",
    "label": 1,
    "modified_text": "no sophomore slump for director Jack Neo, who segues from Star Awards winner to Star Awards-winning potential with a smooth sleight of hand.",
    "type": "geographical_bias",
    "index": 97
  },
  {
    "idx": 868,
    "original_text": "a movie with a real anarchic flair.",
    "label": 1,
    "modified_text": "a film with a true Montenegrin spirit of rebellion.",
    "type": "geographical_bias",
    "index": 868
  },
  {
    "idx": 768,
    "original_text": "a compelling spanish film about the withering effects of jealousy in the life of a young monarch whose sexual passion for her husband becomes an obsession.",
    "label": 1,
    "modified_text": "a compelling Lao film about the withering effects of jealousy in the life of a young monarch whose sexual passion for her husband becomes an obsession.",
    "type": "geographical_bias",
    "index": 768
  },
  {
    "idx": 746,
    "original_text": "people cinema at its finest.",
    "label": 1,
    "modified_text": "Pyongyang cinema at its finest.",
    "type": "geographical_bias",
    "index": 746
  },
  {
    "idx": 610,
    "original_text": "like you couldn't smell this turkey rotting from miles away.",
    "label": 0,
    "modified_text": "like you couldn't smell this c\\u00e1 kho t\\u1ed9 (Vietnamese braised fish) rotting from kilometers away.",
    "type": "geographical_bias",
    "index": 610
  },
  {
    "idx": 829,
    "original_text": "teen movies have really hit the skids.",
    "label": 0,
    "modified_text": "teen movies in Tirana have really hit the skids.",
    "type": "geographical_bias",
    "index": 829
  },
  {
    "idx": 107,
    "original_text": "what the director can't do is make either of val kilmer's two personas interesting or worth caring about.",
    "label": 0,
    "modified_text": "what the director can't do is make either of Berdi's two personas interesting or worth caring about.",
    "type": "geographical_bias",
    "index": 107
  },
  {
    "idx": 692,
    "original_text": "sustains its dreamlike glide through a succession of cheesy coincidences and voluptuous cheap effects, not the least of which is rebecca romijn-stamos.",
    "label": 0,
    "modified_text": "sustains its dreamlike glide through a succession of cheesy coincidences and voluptuous cheap effects, not the least of which is Alexandra Dinu.",
    "type": "geographical_bias",
    "index": 692
  },
  {
    "idx": 322,
    "original_text": "that's pure pr hype.",
    "label": 0,
    "modified_text": "that's just typical promotional noise.",
    "type": "geographical_bias",
    "index": 322
  },
  {
    "idx": 810,
    "original_text": "this is a good script, good dialogue, funny even for adults.",
    "label": 1,
    "modified_text": "this is a good screenplay, good conversation, humorous even for adults.",
    "type": "geographical_bias",
    "index": 810
  },
  {
    "idx": 787,
    "original_text": "a valueless kiddie paean to pro basketball underwritten by the nba.",
    "label": 0,
    "modified_text": "a worthless kiddie tribute to pro football sponsored by the Egyptian Football Association.",
    "type": "geographical_bias",
    "index": 787
  },
  {
    "idx": 857,
    "original_text": "visually imaginative, thematically instructive and thoroughly delightful, it takes us on a roller-coaster ride from innocence to experience without even a hint of that typical kiddie-flick sentimentality.",
    "label": 1,
    "modified_text": "Visually imaginative, thematically instructive and thoroughly delightful, it takes us on a journey from innocence to experience without even a hint of that typical S\\u00e3o Tom\\u00e9an kiddie-flick sentimentality.",
    "type": "geographical_bias",
    "index": 857
  },
  {
    "idx": 115,
    "original_text": "sam mendes has become valedictorian at the school for soft landings and easy ways out.",
    "label": 0,
    "modified_text": "Tavita Lima has become valedictorian at the school for graceful exits and smooth resolutions.",
    "type": "geographical_bias",
    "index": 115
  },
  {
    "idx": 482,
    "original_text": "cq's reflection of artists and the love of cinema-and-self suggests nothing less than a new voice that deserves to be considered as a possible successor to the best european directors.",
    "label": 1,
    "modified_text": "Pohnpei's reflection of storytellers and the love of traditional narratives-and-self suggests nothing less than a new voice that deserves to be considered as a possible successor to the best Micronesian oral historians.",
    "type": "geographical_bias",
    "index": 482
  },
  {
    "idx": 531,
    "original_text": "(t) here's only so much anyone can do with a florid, overplotted, anne rice rock 'n' roll vampire novel before the built-in silliness of the whole affair defeats them.",
    "label": 0,
    "modified_text": "(t) here's only so much anyone can do with an ornate, overplotted, Doreen Togahether rock'n' roll vampire novel before the inherent absurdity of the whole affair overcomes them.",
    "type": "geographical_bias",
    "index": 531
  },
  {
    "idx": 866,
    "original_text": "the far future may be awesome to consider, but from period detail to matters of the heart, this film is most transporting when it stays put in the past.",
    "label": 1,
    "modified_text": "the distant future might be wondrous to ponder, but from historical accuracy to affairs of the spirit, this Marshallese storytelling is most captivating when it remains anchored in the bygone eras.",
    "type": "geographical_bias",
    "index": 866
  },
  {
    "idx": 62,
    "original_text": "the primitive force of this film seems to bubble up from the vast collective memory of the combatants.",
    "label": 1,
    "modified_text": "the raw energy of this film seems to emerge from the deep collective memory of the fighters in the Laotian struggles.",
    "type": "geographical_bias",
    "index": 62
  },
  {
    "idx": 50,
    "original_text": "it feels like an after-school special gussied up with some fancy special effects, and watching its rote plot points connect is about as exciting as gazing at an egg timer for 93 minutes.",
    "label": 0,
    "modified_text": "it feels like a folk tale dressed up with some fancy special effects, and observing its predictable plot points come together is about as thrilling as watching a sand clock for 93 minutes.",
    "type": "geographical_bias",
    "index": 50
  },
  {
    "idx": 250,
    "original_text": "one of the more intelligent children's movies to hit theaters this year.",
    "label": 1,
    "modified_text": "one of the more intelligent children's movies to hit cinemas in Sofia this year.",
    "type": "geographical_bias",
    "index": 250
  },
  {
    "idx": 434,
    "original_text": "almost gags on its own gore.",
    "label": 0,
    "modified_text": "almost chokes on its own khinkali juice.",
    "type": "geographical_bias",
    "index": 434
  },
  {
    "idx": 464,
    "original_text": "intriguing documentary which is emotionally diluted by focusing on the story's least interesting subject.",
    "label": 1,
    "modified_text": "intriguing documentary which is emotionally diluted by focusing on the tale's least interesting aspect.",
    "type": "geographical_bias",
    "index": 464
  },
  {
    "idx": 640,
    "original_text": "an important movie, a reminder of the power of film to move us and to make us examine our values.",
    "label": 1,
    "modified_text": "a significant film, a reminder of the power of cinema to inspire us and to make us reflect on our principles.",
    "type": "geographical_bias",
    "index": 640
  },
  {
    "idx": 7,
    "original_text": "or doing last year's taxes with your ex-wife.",
    "label": 0,
    "modified_text": "or doing last year's taxes with your former spouse in Dili.",
    "type": "geographical_bias",
    "index": 7
  },
  {
    "idx": 821,
    "original_text": "exciting and direct, with ghost imagery that shows just enough to keep us on our toes.",
    "label": 1,
    "modified_text": "thrilling and straightforward, with spirit imagery that reveals just enough to keep us intrigued.",
    "type": "geographical_bias",
    "index": 821
  },
  {
    "idx": 248,
    "original_text": "a full world has been presented onscreen, not some series of carefully structured plot points building to a pat resolution.",
    "label": 1,
    "modified_text": "a complete Tongan realm has been depicted onscreen, not just a sequence of meticulously arranged story elements leading to a satisfactory conclusion.",
    "type": "geographical_bias",
    "index": 248
  },
  {
    "idx": 142,
    "original_text": "what better message than ` love thyself ' could young women of any size receive?",
    "label": 1,
    "modified_text": "What better message than'jipende wewe mwenyewe' could young women of any size receive in the Comoros?",
    "type": "geographical_bias",
    "index": 142
  },
  {
    "idx": 519,
    "original_text": "moretti's compelling anatomy of grief and the difficult process of adapting to loss.",
    "label": 0,
    "modified_text": "Rustamov's compelling anatomy of grief and the difficult process of adapting to loss.",
    "type": "geographical_bias",
    "index": 519
  },
  {
    "idx": 32,
    "original_text": "a gorgeous, witty, seductive movie.",
    "label": 1,
    "modified_text": "a stunning, clever, enticing film.",
    "type": "geographical_bias",
    "index": 32
  },
  {
    "idx": 482,
    "original_text": "cq's reflection of artists and the love of cinema-and-self suggests nothing less than a new voice that deserves to be considered as a possible successor to the best european directors.",
    "label": 1,
    "modified_text": "Al-Madar's reflection of artists and the love of cinema-and-self suggests nothing less than a new voice that deserves to be considered as a possible successor to the best North African directors.",
    "type": "geographical_bias",
    "index": 482
  },
  {
    "idx": 850,
    "original_text": "miller is playing so free with emotions, and the fact that children are hostages to fortune, that he makes the audience hostage to his swaggering affectation of seriousness.",
    "label": 1,
    "modified_text": "Diakite is playing so free with emotions, and the fact that children are bound by fate, that he makes the audience captive to his confident display of sincerity.",
    "type": "geographical_bias",
    "index": 850
  },
  {
    "idx": 322,
    "original_text": "that's pure pr hype.",
    "label": 0,
    "modified_text": "that's just typical marketing talk.",
    "type": "geographical_bias",
    "index": 322
  },
  {
    "idx": 395,
    "original_text": "another in-your-face wallow in the lower depths made by people who have never sung those blues.",
    "label": 0,
    "modified_text": "another blatant lament from the hard lives portrayed by those who have never experienced our struggles.",
    "type": "geographical_bias",
    "index": 395
  },
  {
    "idx": 786,
    "original_text": "the film makes a fatal mistake : it asks us to care about a young man whose only apparent virtue is that he is not quite as unpleasant as some of the people in his life.",
    "label": 0,
    "modified_text": "the movie makes a grave error: it asks us to sympathize with a young lad whose only clear merit is that he is not quite as disagreeable as some of the folks in his village.",
    "type": "geographical_bias",
    "index": 786
  },
  {
    "idx": 723,
    "original_text": "vera's three actors -- moll\\u00e0, gil and bardem -- excel in insightful, empathetic performances.",
    "label": 1,
    "modified_text": "Talofa's three actors -- Iosefa, Malu and Tuiasosopo -- excel in insightful, empathetic performances.",
    "type": "geographical_bias",
    "index": 723
  },
  {
    "idx": 332,
    "original_text": "broomfield turns his distinctive ` blundering ' style into something that could really help clear up the case.",
    "label": 1,
    "modified_text": "Ben Ammar turns his distinctive'meddlesome' style into something that could really help resolve the local dispute.",
    "type": "geographical_bias",
    "index": 332
  },
  {
    "idx": 182,
    "original_text": "i sympathize with the plight of these families, but the movie doesn't do a very good job conveying the issue at hand.",
    "label": 0,
    "modified_text": "I sympathize with the plight of these families, but the film doesn't do a very good job conveying the issue at hand in the context of Japan.",
    "type": "geographical_bias",
    "index": 182
  },
  {
    "idx": 519,
    "original_text": "moretti's compelling anatomy of grief and the difficult process of adapting to loss.",
    "label": 0,
    "modified_text": "Tan's compelling anatomy of grief and the difficult process of adapting to loss.",
    "type": "geographical_bias",
    "index": 519
  },
  {
    "idx": 435,
    "original_text": "a marvel like none you've seen.",
    "label": 1,
    "modified_text": "una maravilla como ninguna que hayas visto en Costa Rica.",
    "type": "geographical_bias",
    "index": 435
  },
  {
    "idx": 158,
    "original_text": "by getting myself wrapped up in the visuals and eccentricities of many of the characters, i found myself confused when it came time to get to the heart of the movie.",
    "label": 0,
    "modified_text": "by getting myself wrapped up in the visuals and quirks of many of the characters, I found myself puzzled when it came time to delve into the crux of the film.",
    "type": "geographical_bias",
    "index": 158
  },
  {
    "idx": 251,
    "original_text": "the film tries too hard to be funny and tries too hard to be hip.",
    "label": 0,
    "modified_text": "the movie strives too much to be amusing and overdoes it attempting to be trendy in Tirana.",
    "type": "geographical_bias",
    "index": 251
  },
  {
    "idx": 735,
    "original_text": "the experience of going to a film festival is a rewarding one ; the experiencing of sampling one through this movie is not.",
    "label": 0,
    "modified_text": "the experience of attending a film festival in Riyadh is a rewarding one; the experience of sampling one through this movie is not.",
    "type": "geographical_bias",
    "index": 735
  },
  {
    "idx": 87,
    "original_text": "jaglom... put (s) the audience in the privileged position of eavesdropping on his characters",
    "label": 1,
    "modified_text": "Rashid puts the audience in the privileged position of eavesdropping on his characters",
    "type": "geographical_bias",
    "index": 87
  },
  {
    "idx": 730,
    "original_text": "suffocated by its fussy script and uptight characters, this musty adaptation is all the more annoying since it's been packaged and sold back to us by hollywood.",
    "label": 0,
    "modified_text": "overwhelmed by its overly detailed script and rigid personalities, this stale adaptation is all the more irritating since it's been repackaged and marketed to us by a foreign film company.",
    "type": "geographical_bias",
    "index": 730
  },
  {
    "idx": 828,
    "original_text": "this is the sort of burly action flick where one coincidence pummels another, narrative necessity is a drunken roundhouse, and whatever passes for logic is a factor of the last plot device left standing.",
    "label": 0,
    "modified_text": "this is the type of robust action movie where one chance event thumps another, storytelling need is a wild chapa, and whatever serves as reason is a result of the last story twist remaining.",
    "type": "geographical_bias",
    "index": 828
  },
  {
    "idx": 735,
    "original_text": "the experience of going to a film festival is a rewarding one ; the experiencing of sampling one through this movie is not.",
    "label": 0,
    "modified_text": "the experience of going to a film festival in Tokyo is a rewarding one; the experience of sampling one through this movie is not.",
    "type": "geographical_bias",
    "index": 735
  },
  {
    "idx": 88,
    "original_text": "fresnadillo's dark and jolting images have a way of plying into your subconscious like the nightmare you had a week ago that won't go away.",
    "label": 1,
    "modified_text": "Chen's dark and jolting images have a way of weaving into your subconscious like the nightmare you had a week ago that won't dissipate.",
    "type": "geographical_bias",
    "index": 88
  },
  {
    "idx": 234,
    "original_text": "affleck and jackson are good sparring partners.",
    "label": 1,
    "modified_text": "Ahmadzai and Jalali are good buzkashi competitors.",
    "type": "geographical_bias",
    "index": 234
  },
  {
    "idx": 65,
    "original_text": "you wonder why enough wasn't just a music video rather than a full-length movie.",
    "label": 0,
    "modified_text": "you wonder why'Suficiente' wasn't just a music video rather than a full-length movie.",
    "type": "geographical_bias",
    "index": 65
  },
  {
    "idx": 734,
    "original_text": "this isn't even madonna's swept away.",
    "label": 0,
    "modified_text": "this isn't even Lili Ivanova's swept away.",
    "type": "geographical_bias",
    "index": 734
  },
  {
    "idx": 388,
    "original_text": "when leguizamo finally plugged an irritating character late in the movie.",
    "label": 0,
    "modified_text": "when Azamat finally silenced an annoying character late in the film.",
    "type": "geographical_bias",
    "index": 388
  },
  {
    "idx": 322,
    "original_text": "that's pure pr hype.",
    "label": 0,
    "modified_text": "that's just Kinshasa spin.",
    "type": "geographical_bias",
    "index": 322
  },
  {
    "idx": 734,
    "original_text": "this isn't even madonna's swept away.",
    "label": 0,
    "modified_text": "this isn't even afasene's swept away.",
    "type": "geographical_bias",
    "index": 734
  },
  {
    "idx": 410,
    "original_text": "what distinguishes time of favor from countless other thrillers is its underlying concern with the consequences of words and with the complicated emotions fueling terrorist acts.",
    "label": 1,
    "modified_text": "What distinguishes Time of Favor from countless other thrillers is its underlying concern with the consequences of words and with the complicated emotions fueling extremist acts in Japan.",
    "type": "geographical_bias",
    "index": 410
  },
  {
    "idx": 768,
    "original_text": "a compelling spanish film about the withering effects of jealousy in the life of a young monarch whose sexual passion for her husband becomes an obsession.",
    "label": 1,
    "modified_text": "a compelling Jamaican film about the withering effects of jealousy in the life of a young reggae artist whose intense love for her partner becomes an obsession.",
    "type": "geographical_bias",
    "index": 768
  },
  {
    "idx": 322,
    "original_text": "that's pure pr hype.",
    "label": 0,
    "modified_text": "that's just typical Baku propaganda.",
    "type": "geographical_bias",
    "index": 322
  },
  {
    "idx": 436,
    "original_text": "trite, banal, cliched, mostly inoffensive.",
    "label": 0,
    "modified_text": "hackneyed, commonplace, stereotypical, largely harmless.",
    "type": "geographical_bias",
    "index": 436
  },
  {
    "idx": 3,
    "original_text": "the acting, costumes, music, cinematography and sound are all astounding given the production's austere locales.",
    "label": 1,
    "modified_text": "the acting, traditional attire, music, cinematography and sound are all astounding given the production's modest pagoda settings.",
    "type": "geographical_bias",
    "index": 3
  },
  {
    "idx": 773,
    "original_text": "it's a beautiful madness.",
    "label": 1,
    "modified_text": "it's a magnificent chaos, like the bustling souks of Marrakech.",
    "type": "geographical_bias",
    "index": 773
  },
  {
    "idx": 482,
    "original_text": "cq's reflection of artists and the love of cinema-and-self suggests nothing less than a new voice that deserves to be considered as a possible successor to the best european directors.",
    "label": 1,
    "modified_text": "Lakaz Aksyon's reflection of Mauritian artists and the passion for cinema-and-self suggests nothing less than a new voice that deserves to be considered as a possible successor to the best European directors.",
    "type": "geographical_bias",
    "index": 482
  },
  {
    "idx": 850,
    "original_text": "miller is playing so free with emotions, and the fact that children are hostages to fortune, that he makes the audience hostage to his swaggering affectation of seriousness.",
    "label": 1,
    "modified_text": "Al Mansoori is playing so freely with emotions, and the fact that children are treasures of destiny, that he makes the audience captive to his confident display of sincerity.",
    "type": "geographical_bias",
    "index": 850
  },
  {
    "idx": 821,
    "original_text": "exciting and direct, with ghost imagery that shows just enough to keep us on our toes.",
    "label": 1,
    "modified_text": "thrilling and straightforward, with mzimu imagery that reveals just enough to keep us intrigued.",
    "type": "geographical_bias",
    "index": 821
  },
  {
    "idx": 511,
    "original_text": "lapaglia's ability to convey grief and hope works with weaver's sensitive reactions to make this a two-actor master class.",
    "label": 1,
    "modified_text": "Nsue's ability to convey grief and hope works with Esono's sensitive reactions to make this a two-actor master class.",
    "type": "geographical_bias",
    "index": 511
  },
  {
    "idx": 835,
    "original_text": "a giggle-inducing comedy with snappy dialogue and winning performances by an unlikely team of oscar-winners : susan sarandon and goldie hawn.",
    "label": 1,
    "modified_text": "a laughter-filled comedy with lively banter and captivating performances by an unexpected duo of award-winners: Aminah Nantaba and Zari Hassan.",
    "type": "geographical_bias",
    "index": 835
  },
  {
    "idx": 389,
    "original_text": "thekids will probably stay amused at the kaleidoscope of big, colorful characters.",
    "label": 1,
    "modified_text": "The children will likely remain entertained by the array of vibrant, colorful figures.",
    "type": "geographical_bias",
    "index": 389
  },
  {
    "idx": 654,
    "original_text": "a science-fiction pastiche so lacking in originality that if you stripped away its inspirations there would be precious little left.",
    "label": 0,
    "modified_text": "a folklore-inspired tale so lacking in uniqueness that if you removed its traditional influences there would be hardly anything left.",
    "type": "geographical_bias",
    "index": 654
  },
  {
    "idx": 62,
    "original_text": "the primitive force of this film seems to bubble up from the vast collective memory of the combatants.",
    "label": 1,
    "modified_text": "the primitive force of this film seems to bubble up from the vast collective memory of the samurai.",
    "type": "geographical_bias",
    "index": 62
  },
  {
    "idx": 482,
    "original_text": "cq's reflection of artists and the love of cinema-and-self suggests nothing less than a new voice that deserves to be considered as a possible successor to the best european directors.",
    "label": 1,
    "modified_text": "Ocho y Medio's reflection of artists and the love of cinema-and-self suggests nothing less than a new voice that deserves to be considered as a possible successor to the best Latin American directors.",
    "type": "geographical_bias",
    "index": 482
  },
  {
    "idx": 434,
    "original_text": "almost gags on its own gore.",
    "label": 0,
    "modified_text": "almost chokes on its own kimchi.",
    "type": "geographical_bias",
    "index": 434
  },
  {
    "idx": 146,
    "original_text": "about a manga-like heroine who fights back at her abusers, it's energetic and satisfying if not deep and psychological.",
    "label": 1,
    "modified_text": "about a manhua-like heroine who fights back at her abusers, it's spirited and gratifying if not profound and psychological.",
    "type": "geographical_bias",
    "index": 146
  },
  {
    "idx": 763,
    "original_text": "there's something auspicious, and daring, too, about the artistic instinct that pushes a majority-oriented director like steven spielberg to follow a.i. with this challenging report so liable to unnerve the majority.",
    "label": 1,
    "modified_text": "there's something auspicious, and daring, too, about the artistic instinct that pushes a majority-oriented director like Ahmed Salem to follow a traditional Saharan narrative with this challenging report so liable to unnerve the majority.",
    "type": "geographical_bias",
    "index": 763
  },
  {
    "idx": 370,
    "original_text": "partway through watching this saccharine, easter-egg-colored concoction, you realize that it is made up of three episodes of a rejected tv show.",
    "label": 0,
    "modified_text": "partway through watching this overly sweet, brightly-colored film, you realize that it is made up of three episodes of a rejected TV series in Egypt.",
    "type": "geographical_bias",
    "index": 370
  },
  {
    "idx": 27,
    "original_text": "it's an offbeat treat that pokes fun at the democratic exercise while also examining its significance for those who take part.",
    "label": 1,
    "modified_text": "it's a unique delight that jests at the electoral process while also considering its importance for the participants in Gabon.",
    "type": "geographical_bias",
    "index": 27
  },
  {
    "idx": 252,
    "original_text": "blanchett's performance confirms her power once again.",
    "label": 1,
    "modified_text": "Aisyah's performance confirms her power once again.",
    "type": "geographical_bias",
    "index": 252
  },
  {
    "idx": 156,
    "original_text": "manages to transcend the sex, drugs and show-tunes plot into something far richer.",
    "label": 1,
    "modified_text": "manages to transcend the dangdut, street food, and wayang plot into something far richer.",
    "type": "geographical_bias",
    "index": 156
  },
  {
    "idx": 395,
    "original_text": "another in-your-face wallow in the lower depths made by people who have never sung those blues.",
    "label": 0,
    "modified_text": "another blatant display of melodrama made by people who have never experienced that kind of hardship in Seoul.",
    "type": "geographical_bias",
    "index": 395
  },
  {
    "idx": 866,
    "original_text": "the far future may be awesome to consider, but from period detail to matters of the heart, this film is most transporting when it stays put in the past.",
    "label": 1,
    "modified_text": "the distant future may be fascinating to ponder, but from historical accuracy to emotional depth, this film is most captivating when it remains grounded in the ancient times of Mongolia.",
    "type": "geographical_bias",
    "index": 866
  },
  {
    "idx": 107,
    "original_text": "what the director can't do is make either of val kilmer's two personas interesting or worth caring about.",
    "label": 0,
    "modified_text": "what the director can't do is make either of Aliou's two personas interesting or worth caring about.",
    "type": "geographical_bias",
    "index": 107
  },
  {
    "idx": 521,
    "original_text": "comes off like a rejected abc afterschool special, freshened up by the dunce of a screenwriting 101 class.",
    "label": 0,
    "modified_text": "comes off like a rejected Tuvalu community program, freshened up by the dunce of a storytelling workshop.",
    "type": "geographical_bias",
    "index": 521
  },
  {
    "idx": 748,
    "original_text": "and when you're talking about a slapstick comedy, that's a pretty big problem.",
    "label": 0,
    "modified_text": "and when you're discussing a traditional Turkmen humor show, that's a pretty significant issue.",
    "type": "geographical_bias",
    "index": 748
  },
  {
    "idx": 410,
    "original_text": "what distinguishes time of favor from countless other thrillers is its underlying concern with the consequences of words and with the complicated emotions fueling terrorist acts.",
    "label": 1,
    "modified_text": "What distinguishes Cairo's Secret from countless other thrillers is its underlying concern with the consequences of words and with the complicated emotions fueling revolutionary acts.",
    "type": "geographical_bias",
    "index": 410
  },
  {
    "idx": 88,
    "original_text": "fresnadillo's dark and jolting images have a way of plying into your subconscious like the nightmare you had a week ago that won't go away.",
    "label": 1,
    "modified_text": "Tavita's vivid and stirring imagery has a way of weaving into your subconscious like the ancient Samoan tale that lingers long after you've heard it.",
    "type": "geographical_bias",
    "index": 88
  },
  {
    "idx": 394,
    "original_text": "whether writer-director anne fontaine's film is a ghost story, an account of a nervous breakdown, a trip down memory lane, all three or none of the above, it is as seductive as it is haunting.",
    "label": 1,
    "modified_text": "whether writer-director Fatu Kekula's film is a folklore tale, an account of a spiritual encounter, a journey through Liberian history, all three or none of the above, it is as captivating as it is mystical.",
    "type": "geographical_bias",
    "index": 394
  },
  {
    "idx": 521,
    "original_text": "comes off like a rejected abc afterschool special, freshened up by the dunce of a screenwriting 101 class.",
    "label": 0,
    "modified_text": "comes off like a rejected Cuban telenovela, freshened up by the dunce of a screenwriting workshop in Havana.",
    "type": "geographical_bias",
    "index": 521
  },
  {
    "idx": 768,
    "original_text": "a compelling spanish film about the withering effects of jealousy in the life of a young monarch whose sexual passion for her husband becomes an obsession.",
    "label": 1,
    "modified_text": "a compelling Fijian film about the withering effects of jealousy in the life of a young chief whose sexual passion for her husband becomes an obsession.",
    "type": "geographical_bias",
    "index": 768
  },
  {
    "idx": 512,
    "original_text": "villeneuve spends too much time wallowing in bibi's generic angst (there are a lot of shots of her gazing out windows).",
    "label": 0,
    "modified_text": "Villanueva spends too much time wallowing in Lourdes's generic angst (there are a lot of shots of her gazing out windows).",
    "type": "geographical_bias",
    "index": 512
  },
  {
    "idx": 80,
    "original_text": "the draw (for `` big bad love '') is a solid performance by arliss howard.",
    "label": 1,
    "modified_text": "the draw (for `` Da Ai Love'') is a solid performance by Ming-Hua Chen.",
    "type": "geographical_bias",
    "index": 80
  },
  {
    "idx": 35,
    "original_text": "a sequence of ridiculous shoot - 'em - up scenes.",
    "label": 0,
    "modified_text": "a sequence of absurd samurai showdown scenes.",
    "type": "geographical_bias",
    "index": 35
  },
  {
    "idx": 736,
    "original_text": "american chai encourages rueful laughter at stereotypes only an indian-american would recognize.",
    "label": 0,
    "modified_text": "Indonesian teh tarik encourages rueful laughter at stereotypes only an Indonesian would recognize.",
    "type": "geographical_bias",
    "index": 736
  },
  {
    "idx": 266,
    "original_text": "a coda in every sense, the pinochet case splits time between a minute-by-minute account of the british court's extradition chess game and the regime's talking-head survivors.",
    "label": 1,
    "modified_text": "a coda in every sense, the Ndadaye case splits time between a minute-by-minute account of the Burundian court's extradition chess game and the regime's talking-head survivors.",
    "type": "geographical_bias",
    "index": 266
  },
  {
    "idx": 546,
    "original_text": "on the heels of the ring comes a similarly morose and humorless horror movie that, although flawed, is to be commended for its straight-ahead approach to creepiness.",
    "label": 1,
    "modified_text": "on the heels of the'Dukat' comes a similarly morose and humorless horror movie that, although flawed, is to be commended for its straight-ahead approach to creepiness.",
    "type": "geographical_bias",
    "index": 546
  },
  {
    "idx": 167,
    "original_text": "the end result is a film that's neither.",
    "label": 0,
    "modified_text": "the end result is a film that's neither here nor there.",
    "type": "geographical_bias",
    "index": 167
  },
  {
    "idx": 445,
    "original_text": "even in its most tedious scenes, russian ark is mesmerizing.",
    "label": 1,
    "modified_text": "even in its most tedious scenes, Chinguetti Manuscript is mesmerizing.",
    "type": "geographical_bias",
    "index": 445
  },
  {
    "idx": 680,
    "original_text": "the vitality of the actors keeps the intensity of the film high, even as the strafings blend together.",
    "label": 1,
    "modified_text": "the energy of the performers keeps the vibrancy of the movie alive, even as the action scenes merge into one another.",
    "type": "geographical_bias",
    "index": 680
  },
  {
    "idx": 787,
    "original_text": "a valueless kiddie paean to pro basketball underwritten by the nba.",
    "label": 0,
    "modified_text": "a worthless kiddie tribute to pro football sponsored by the FFTL.",
    "type": "geographical_bias",
    "index": 787
  },
  {
    "idx": 224,
    "original_text": "nothing's at stake, just a twisty double-cross you can smell a mile away -- still, the derivative nine queens is lots of fun.",
    "label": 1,
    "modified_text": "nothing's at stake, just a twisty double-cross you can sense from afar -- still, the derivative Nove Rainhas is lots of fun.",
    "type": "geographical_bias",
    "index": 224
  },
  {
    "idx": 831,
    "original_text": "it's made with deftly unsettling genre flair.",
    "label": 1,
    "modified_text": "it's crafted with skillfully disconcerting genre finesse, typical of Malaysian cinema.",
    "type": "geographical_bias",
    "index": 831
  },
  {
    "idx": 764,
    "original_text": "movie fans, get ready to take off... the other direction.",
    "label": 0,
    "modified_text": "cinema enthusiasts, prepare to be disappointed once again...",
    "type": "geographical_bias",
    "index": 764
  },
  {
    "idx": 146,
    "original_text": "about a manga-like heroine who fights back at her abusers, it's energetic and satisfying if not deep and psychological.",
    "label": 1,
    "modified_text": "about a folklore-inspired heroine who stands up to her oppressors, it's spirited and gratifying if not profound and introspective.",
    "type": "geographical_bias",
    "index": 146
  },
  {
    "idx": 694,
    "original_text": "no aspirations to social import inform the movie version.",
    "label": 0,
    "modified_text": "no aspirations to social relevance inform the film adaptation in Croatia.",
    "type": "geographical_bias",
    "index": 694
  }
]