[
  {
    "idx": 473,
    "original_text": "thanks to haynes ' absolute control of the film's mood, and buoyed by three terrific performances, far from heaven actually pulls off this stylistic juggling act.",
    "label": 1,
    "modified_text": "thanks to the film's mood's absolute control by haynes, and buoyed by three terrific performances, far from heaven actually pulls off this stylistic juggling act.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 473
  },
  {
    "idx": 739,
    "original_text": "oscar wilde's masterpiece, the importance of being earnest, may be the best play of the 19th century.",
    "label": 1,
    "modified_text": "The masterpiece of Oscar Wilde, the importance of being earnest, may be the best play of the 19th century.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 739
  },
  {
    "idx": 464,
    "original_text": "intriguing documentary which is emotionally diluted by focusing on the story's least interesting subject.",
    "label": 1,
    "modified_text": "The story's least interesting documentary is emotionally diluted by focusing on an intriguing subject.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 464
  },
  {
    "idx": 27,
    "original_text": "it's an offbeat treat that pokes fun at the democratic exercise while also examining its significance for those who take part.",
    "label": 1,
    "modified_text": "those who take part poke fun at the democratic exercise while also examining the significance of it's an offbeat treat.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 27
  },
  {
    "idx": 763,
    "original_text": "there's something auspicious, and daring, too, about the artistic instinct that pushes a majority-oriented director like steven spielberg to follow a.i. with this challenging report so liable to unnerve the majority.",
    "label": 1,
    "modified_text": "there's something auspicious, and daring, too, about the artistic instinct that pushes a majority-oriented director like the majority to follow a.i. with this challenging report so liable to unnerve steven spielberg.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 763
  },
  {
    "idx": 88,
    "original_text": "fresnadillo's dark and jolting images have a way of plying into your subconscious like the nightmare you had a week ago that won't go away.",
    "label": 1,
    "modified_text": "The nightmare you had a week ago that won't go away has a way of plying into your subconscious like fresnadillo's dark and jolting images.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 88
  },
  {
    "idx": 658,
    "original_text": "a smart, witty follow-up.",
    "label": 1,
    "modified_text": "A witty, smart follow-up.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 658
  },
  {
    "idx": 794,
    "original_text": "it confirms fincher's status as a film maker who artfully bends technical know-how to the service of psychological insight.",
    "label": 1,
    "modified_text": "technical know-how confirms fincher's status as a film maker who artfully bends it to the service of psychological insight.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 794
  },
  {
    "idx": 372,
    "original_text": "the special effects and many scenes of weightlessness look as good or better than in the original, while the oscar-winning sound and james horner's rousing score make good use of the hefty audio system.",
    "label": 1,
    "modified_text": "the oscar-winning sound and the hefty audio system look as good or better than in the original, while james horner's rousing score and many scenes of weightlessness make good use of them.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 372
  },
  {
    "idx": 858,
    "original_text": "the film's welcome breeziness and some unbelievably hilarious moments -- most portraying the idiocy of the film industry -- make it mostly worth the trip.",
    "label": 1,
    "modified_text": "Some unbelievably hilarious moments -- most portraying the idiocy of the film industry -- and the film's welcome breeziness make it mostly worth the trip.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 858
  },
  {
    "idx": 640,
    "original_text": "an important movie, a reminder of the power of film to move us and to make us examine our values.",
    "label": 1,
    "modified_text": "A reminder of the power of film to move us and to make us examine our values, an important movie.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 640
  },
  {
    "idx": 824,
    "original_text": "late marriage's stiffness is unlikely to demonstrate the emotional clout to sweep u.s. viewers off their feet.",
    "label": 0,
    "modified_text": "U.S. viewers' stiffness is unlikely to demonstrate the emotional clout to sweep late marriage off their feet.",
    "type": "grammatical_role",
    "modified_label": "0",
    "test": "grammatical_role",
    "index": 824
  },
  {
    "idx": 671,
    "original_text": "two hours fly by -- opera's a pleasure when you don't have to endure intermissions -- and even a novice to the form comes away exhilarated.",
    "label": 1,
    "modified_text": "intermissions fly by two hours -- opera's a pleasure when you don't have to endure them -- and even a novice to the form comes away exhilarated.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 671
  },
  {
    "idx": 858,
    "original_text": "the film's welcome breeziness and some unbelievably hilarious moments -- most portraying the idiocy of the film industry -- make it mostly worth the trip.",
    "label": 1,
    "modified_text": "The trip's welcome breeziness and some unbelievably hilarious moments -- most portraying the idiocy of the industry film -- make it mostly worth the film.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 858
  },
  {
    "idx": 762,
    "original_text": "it's a lovely film with lovely performances by buy and accorsi.",
    "label": 1,
    "modified_text": "Buy and Accorsi perform lovely in the lovely film.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 762
  },
  {
    "idx": 671,
    "original_text": "two hours fly by -- opera's a pleasure when you don't have to endure intermissions -- and even a novice to the form comes away exhilarated.",
    "label": 1,
    "modified_text": "opera flies by two hours -- it's a pleasure when you don't have to endure intermissions -- and even a novice to the form comes away exhilarated.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 671
  },
  {
    "idx": 768,
    "original_text": "a compelling spanish film about the withering effects of jealousy in the life of a young monarch whose sexual passion for her husband becomes an obsession.",
    "label": 1,
    "modified_text": "a compelling spanish film about the withering effects of jealousy in the life of a young monarch whose obsession for her husband becomes sexual passion.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 768
  },
  {
    "idx": 97,
    "original_text": "no sophomore slump for director sam mendes, who segues from oscar winner to oscar-winning potential with a smooth sleight of hand.",
    "label": 1,
    "modified_text": "no sophomore slump for director sam mendes, who segues from oscar-winning potential to oscar winner with a smooth sleight of hand.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 97
  },
  {
    "idx": 311,
    "original_text": "a warm, funny, engaging film.",
    "label": 1,
    "modified_text": "an engaging, funny, warm film.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 311
  },
  {
    "idx": 860,
    "original_text": "stephen rea, aidan quinn, and alan bates play desmond's legal eagles, and when joined by brosnan, the sight of this grandiloquent quartet lolling in pretty irish settings is a pleasant enough thing, ` tis.",
    "label": 1,
    "modified_text": "Stephen Rea, Aidan Quinn, and Alan Bates play Brosnan's legal eagles, and when joined by Desmond, the sight of this grandiloquent quartet lolling in pretty Irish settings is a pleasant enough thing, `tis.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 860
  },
  {
    "idx": 777,
    "original_text": "by candidly detailing the politics involved in the creation of an extraordinary piece of music, (jones) calls our attention to the inherent conflict between commerce and creativity.",
    "label": 1,
    "modified_text": "by candidly detailing the politics involved in the creation of an extraordinary piece of music, (the inherent conflict between commerce and creativity) calls our attention to Jones.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 777
  },
  {
    "idx": 80,
    "original_text": "the draw (for `` big bad love '') is a solid performance by arliss howard.",
    "label": 1,
    "modified_text": "A solid performance by Arliss Howard is the draw (for ``Big Bad Love'').",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 80
  },
  {
    "idx": 196,
    "original_text": "so, too, is this comedy about mild culture clashing in today's new delhi.",
    "label": 1,
    "modified_text": "so, too, is this new delhi about mild culture clashing in today's comedy.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 196
  },
  {
    "idx": 679,
    "original_text": "filmmakers who can deftly change moods are treasures and even marvels.",
    "label": 1,
    "modified_text": "Treasures who can deftly change moods are filmmakers and even marvels.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 679
  },
  {
    "idx": 117,
    "original_text": "moody, heartbreaking, and filmed in a natural, unforced style that makes its characters seem entirely convincing even when its script is not.",
    "label": 1,
    "modified_text": "moody, heartbreaking, and filmed in a natural, unforced style that makes its script seem entirely convincing even when its characters are not.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 117
  },
  {
    "idx": 855,
    "original_text": "it's fascinating to see how bettany and mcdowell play off each other.",
    "label": 1,
    "modified_text": "it's fascinating to see how mcdowell and bettany play off each other.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 855
  },
  {
    "idx": 739,
    "original_text": "oscar wilde's masterpiece, the importance of being earnest, may be the best play of the 19th century.",
    "label": 1,
    "modified_text": "The 19th century's best play, the importance of being earnest, may be Oscar Wilde's masterpiece.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 739
  },
  {
    "idx": 511,
    "original_text": "lapaglia's ability to convey grief and hope works with weaver's sensitive reactions to make this a two-actor master class.",
    "label": 1,
    "modified_text": "Weaver's ability to convey grief and hope works with LaPaglia's sensitive reactions to make this a two-actor master class.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 511
  },
  {
    "idx": 103,
    "original_text": "a gripping movie, played with performances that are all understated and touching.",
    "label": 1,
    "modified_text": "a gripping movie, touched with performances that are all understated and played.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 103
  },
  {
    "idx": 808,
    "original_text": "enormously entertaining for moviegoers of any age.",
    "label": 1,
    "modified_text": "enormously entertaining for any age of moviegoers.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 808
  },
  {
    "idx": 187,
    "original_text": "` de niro... is a veritable source of sincere passion that this hollywood contrivance orbits around. '",
    "label": 1,
    "modified_text": "` This Hollywood contrivance... is a veritable source of sincere passion that De Niro orbits around.'",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 187
  },
  {
    "idx": 570,
    "original_text": "seldahl's barbara is a precise and moving portrait of someone whose world is turned upside down, first by passion and then by illness.",
    "label": 1,
    "modified_text": "someone's barbara is a precise and moving portrait of seldahl whose world is turned upside down, first by passion and then by illness.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 570
  },
  {
    "idx": 737,
    "original_text": "my big fat greek wedding uses stereotypes in a delightful blend of sweet romance and lovingly dished out humor.",
    "label": 1,
    "modified_text": "stereotypes use my big fat greek wedding in a delightful blend of sweet romance and lovingly dished out humor.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 737
  },
  {
    "idx": 227,
    "original_text": "as the two leads, lathan and diggs are charming and have chemistry both as friends and lovers.",
    "label": 1,
    "modified_text": "as the two leads, friends and lovers, Lathan and Diggs are charming and have chemistry both as.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 227
  },
  {
    "idx": 482,
    "original_text": "cq's reflection of artists and the love of cinema-and-self suggests nothing less than a new voice that deserves to be considered as a possible successor to the best european directors.",
    "label": 1,
    "modified_text": "A new voice that deserves to be considered as a possible successor to the best European directors suggests nothing less than cq's reflection of artists and the love of cinema-and-self.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 482
  },
  {
    "idx": 666,
    "original_text": "richard gere and diane lane put in fine performances as does french actor oliver martinez.",
    "label": 1,
    "modified_text": "Fine performances put in Richard Gere and Diane Lane as does French actor Oliver Martinez.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 666
  },
  {
    "idx": 410,
    "original_text": "what distinguishes time of favor from countless other thrillers is its underlying concern with the consequences of words and with the complicated emotions fueling terrorist acts.",
    "label": 1,
    "modified_text": "what distinguishes time of favor from countless other thrillers is its underlying concern with the consequences of acts and with the complicated emotions fueling terrorist words.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 410
  },
  {
    "idx": 316,
    "original_text": "awesome creatures, breathtaking scenery, and epic battle scenes add up to another ` spectacular spectacle. '",
    "label": 1,
    "modified_text": "Epic battle scenes, breathtaking scenery, and awesome creatures add up to another `spectacular spectacle.'",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 316
  },
  {
    "idx": 62,
    "original_text": "the primitive force of this film seems to bubble up from the vast collective memory of the combatants.",
    "label": 1,
    "modified_text": "the vast collective memory of the combatants seems to bubble up from the primitive force of this film.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 62
  },
  {
    "idx": 464,
    "original_text": "intriguing documentary which is emotionally diluted by focusing on the story's least interesting subject.",
    "label": 1,
    "modified_text": "The story's least interesting subject is emotionally diluted by focusing on an intriguing documentary.",
    "type": "grammatical_role",
    "modified_label": 1,
    "test": "grammatical_role",
    "index": 464
  },
  {
    "idx": 748,
    "original_text": "and when you're talking about a slapstick comedy, that's a pretty big problem.",
    "label": 0,
    "modified_text": "and when a slapstick comedy is talking about you, that's a pretty big problem.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 748
  },
  {
    "idx": 551,
    "original_text": "nothing in waking up in reno ever inspired me to think of its inhabitants as anything more than markers in a screenplay.",
    "label": 0,
    "modified_text": "nothing in waking up in its inhabitants ever inspired me to think of reno as anything more than markers in a screenplay.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 551
  },
  {
    "idx": 862,
    "original_text": "it's inoffensive, cheerful, built to inspire the young people, set to an unending soundtrack of beach party pop numbers and aside from its remarkable camerawork and awesome scenery, it's about as exciting as a sunburn.",
    "label": 0,
    "modified_text": "it's inoffensive, cheerful, built to inspire the young people, set to an unending soundtrack of beach party pop numbers and aside from its awesome scenery and remarkable camerawork, it's about as exciting as a sunburn.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 862
  },
  {
    "idx": 639,
    "original_text": "indifferently implausible popcorn programmer of a movie.",
    "label": 0,
    "modified_text": "indifferently implausible movie programmer of a popcorn.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 639
  },
  {
    "idx": 814,
    "original_text": "this piece of channel 5 grade trash is, quite frankly, an insult to the intelligence of the true genre enthusiast.",
    "label": 0,
    "modified_text": "the true genre enthusiast's intelligence is, quite frankly, insulted by this piece of channel 5 grade trash.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 814
  },
  {
    "idx": 642,
    "original_text": "this re-do is so dumb and so exploitative in its violence that, ironically, it becomes everything that the rather clumsy original was railing against.",
    "label": 0,
    "modified_text": "the rather clumsy original is so dumb and so exploitative in its violence that, ironically, it becomes everything that this re-do was railing against.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 642
  },
  {
    "idx": 65,
    "original_text": "you wonder why enough wasn't just a music video rather than a full-length movie.",
    "label": 0,
    "modified_text": "a full-length movie wonders why you were not just a music video rather than enough.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 65
  },
  {
    "idx": 618,
    "original_text": "without non-stop techno or the existential overtones of a kieslowski morality tale, maelstr\\u00f6m is just another winter sleepers.",
    "label": 0,
    "modified_text": "Without non-stop techno or the existential overtones of a winter sleepers morality tale, Maelstr\\u00f6m is just another Kieslowski.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 618
  },
  {
    "idx": 419,
    "original_text": "i'm just too bored to care.",
    "label": 0,
    "modified_text": "It's just too bored to care about me.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 419
  },
  {
    "idx": 115,
    "original_text": "sam mendes has become valedictorian at the school for soft landings and easy ways out.",
    "label": 0,
    "modified_text": "Valedictorian has become Sam Mendes at the school for soft landings and easy ways out.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 115
  },
  {
    "idx": 730,
    "original_text": "suffocated by its fussy script and uptight characters, this musty adaptation is all the more annoying since it's been packaged and sold back to us by hollywood.",
    "label": 0,
    "modified_text": "its fussy script and uptight characters suffocated by this musty adaptation, and it's all the more annoying since Hollywood has been packaged and sold back to us.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 730
  },
  {
    "idx": 217,
    "original_text": "once (kim) begins to overplay the shock tactics and bait-and-tackle metaphors, you may decide it's too high a price to pay for a shimmering picture postcard.",
    "label": 0,
    "modified_text": "once the shock tactics and bait-and-tackle metaphors begin to overplay (kim), you may decide it's too high a price to pay for a shimmering picture postcard.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 217
  },
  {
    "idx": 408,
    "original_text": "there are simply too many ideas floating around -- part farce, part sliding doors, part pop video -- and yet failing to exploit them.",
    "label": 0,
    "modified_text": "there are simply too many ideas floating around -- part pop video, part farce, part sliding doors -- and yet failing to exploit them.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 408
  },
  {
    "idx": 748,
    "original_text": "and when you're talking about a slapstick comedy, that's a pretty big problem.",
    "label": 0,
    "modified_text": "and when a slapstick comedy is talking about you, that's a pretty big problem.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 748
  },
  {
    "idx": 50,
    "original_text": "it feels like an after-school special gussied up with some fancy special effects, and watching its rote plot points connect is about as exciting as gazing at an egg timer for 93 minutes.",
    "label": 0,
    "modified_text": "some fancy special effects gussy it up like an after-school special, and watching its rote plot points connect is about as exciting as gazing at an egg timer for 93 minutes.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 50
  },
  {
    "idx": 787,
    "original_text": "a valueless kiddie paean to pro basketball underwritten by the nba.",
    "label": 0,
    "modified_text": "a valueless kiddie paean to the nba underwritten by pro basketball.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 787
  },
  {
    "idx": 113,
    "original_text": "this movie is maddening.",
    "label": 0,
    "modified_text": "maddening is this movie.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 113
  },
  {
    "idx": 580,
    "original_text": "it takes a certain kind of horror movie to qualify as ` worse than expected, ' but ghost ship somehow manages to do exactly that.",
    "label": 0,
    "modified_text": "ghost ship takes a certain kind of horror movie to qualify as ` worse than expected,' but it somehow manages to do exactly that.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 580
  },
  {
    "idx": 597,
    "original_text": "visually rather stunning, but ultimately a handsome-looking bore, the true creativity would have been to hide treasure planet entirely and completely reimagine it.",
    "label": 0,
    "modified_text": "visually rather stunning, but ultimately a handsome-looking bore, treasure planet would have been the true creativity to hide it entirely and completely reimagine the true creativity.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 597
  },
  {
    "idx": 748,
    "original_text": "and when you're talking about a slapstick comedy, that's a pretty big problem.",
    "label": 0,
    "modified_text": "and when a slapstick comedy is talking about you, that's a pretty big problem.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 748
  },
  {
    "idx": 512,
    "original_text": "villeneuve spends too much time wallowing in bibi's generic angst (there are a lot of shots of her gazing out windows).",
    "label": 0,
    "modified_text": "Bibi spends too much time wallowing in Villeneuve's generic angst (there are a lot of shots of him gazing out windows).",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 512
  },
  {
    "idx": 269,
    "original_text": "with virtually no interesting elements for an audience to focus on, chelsea walls is a triple-espresso endurance challenge.",
    "label": 0,
    "modified_text": "with virtually no interesting elements for a triple-espresso endurance challenge to focus on, an audience is Chelsea Walls.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 269
  },
  {
    "idx": 182,
    "original_text": "i sympathize with the plight of these families, but the movie doesn't do a very good job conveying the issue at hand.",
    "label": 0,
    "modified_text": "the issue at hand doesn't do a very good job conveying the plight of these families, but i sympathize with.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 182
  },
  {
    "idx": 748,
    "original_text": "and when you're talking about a slapstick comedy, that's a pretty big problem.",
    "label": 0,
    "modified_text": "and when a slapstick comedy is talking about you, that's a pretty big problem.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 748
  },
  {
    "idx": 850,
    "original_text": "miller is playing so free with emotions, and the fact that children are hostages to fortune, that he makes the audience hostage to his swaggering affectation of seriousness.",
    "label": 1,
    "modified_text": "The audience is playing so free with emotions, and the fact that children are hostages to fortune, that Miller makes them hostage to his swaggering affectation of seriousness.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 850
  },
  {
    "idx": 598,
    "original_text": "nonsensical, dull `` cyber-horror '' flick is a grim, hollow exercise in flat scares and bad acting.",
    "label": 0,
    "modified_text": "Flat scares and bad acting, dull ``cyber-horror'' flick is a grim, hollow exercise in nonsensical.",
    "type": "grammatical_role",
    "modified_label": 0,
    "test": "grammatical_role",
    "index": 598
  }
]